app/views/recips/generate_shopping_list.html.erb

SELECT "foods".* FROM "foods" WHERE "foods"."name" = $1 LIMIT $2  [["name", "Mangoes"], ["LIMIT", 1]]
---
        <td><%= food_name %></td>
        <td><%= quantity %><span> <%= Food.find_by(name: food_name).measurement_unit%></span></td>
        <td>$ <%= "#{quantity * Food.find_by(name: food_name).price}" %></td>