app/views/recips/public_recipe.html.erb

SELECT COUNT(*) FROM "foods" INNER JOIN "recipe_foods" ON "foods"."id" = "recipe_foods"."food_id" WHERE "recipe_foods"."recip_id" = $1  [["recip_id", 1]]
---
    <p>By: <span><%= recipe.author.name.split(" ").second %></span></p>
    <p>Total food items: <span><%= recipe.foods.count %></span></p>