app/controllers/foods_controller.rb

INSERT INTO "foods" ("name", "measurement_unit", "price", "quantity", "created_at", "updated_at", "author_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Mangoes"], ["measurement_unit", "Grams"], ["price", 2], ["quantity", "20 g"], ["created_at", "2023-05-02 21:00:32.312085"], ["updated_at", "2023-05-02 21:00:32.312085"], ["author_id", 1]]
---
  def create
    @food = Food.new(food_params)
    @food.author = current_user

    respond_to do |format|
      if @food.save