app/controllers/recips_controller.rb

  def show
    # Retrieve the associated foods for the Recipe from the RecipeFood join table
    @foods = Food.joins(:recipe_foods).where(recipe_foods: { recip_id: @recip.id }).select('foods.*, recipe_foods.quantity AS quantity').order(created_at: :desc)
---
SELECT foods.*, recipe_foods.quantity AS quantity FROM "foods" INNER JOIN "recipe_foods" ON "recipe_foods"."food_id" = "foods"."id" WHERE "recipe_foods"."recip_id" = $1 ORDER BY "foods"."created_at" DESC  [["recip_id", 2]]

  def create
    @recip = Recip.new(recip_params)
    @recip.author = current_user

    respond_to do |format|
      if @recip.save
---
INSERT INTO "recips" ("name", "preparation_time", "cooking_time", "description", "public", "created_at", "updated_at", "author_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def public_recipe
    @recipes = Recip.all.where(public: true)
---
SELECT "recips".* FROM "recips" WHERE "recips"."public" = $1  [["public", true]]

  def generate_shopping_list
    # Get all recipes
    @recipes = Recip.all

    # Initialize an empty hash to store the food quantities needed
    @shopping_list = {}

    # Initialize a variable to store the total value of foods
    @total_value = 0

    # Iterate through each recipe
    @recipes.each do |recipe|
      # Iterate through the RecipeFoods associated with the recipe
      recipe.recipe_foods.each do |recipe_food|
        food = Food.find(recipe_food.food_id)
---
SELECT "recips".* FROM "recips"
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recip_id" = $1  [["recip_id", 1]]
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]

  def set_recip
    @recip = Recip.find(params[:id])
---
SELECT "recips".* FROM "recips" WHERE "recips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]