app/controllers/recipe_foods_controller.rb

  def new
    @recipe_food = RecipeFood.new
    @recip = Recip.find(params[:recip_id])
    @foods = Food.where.not(id: @recip.foods.pluck(:id))

    if @foods.empty?
---
SELECT "recips".* FROM "recips" WHERE "recips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "foods"."id" FROM "foods" INNER JOIN "recipe_foods" ON "foods"."id" = "recipe_foods"."food_id" WHERE "recipe_foods"."recip_id" = $1  [["recip_id", 1]]
SELECT "foods".* FROM "foods" WHERE 1=1
SELECT 1 AS one FROM "foods" WHERE 1=1 LIMIT $1  [["LIMIT", 1]]

  def create
    @recipe = Recip.find(params[:recip_id])
    @food = Food.find(params[:recipe_food][:food_id])
    @recipe_food = RecipeFood.new(recipe_food_params)
    @recipe_food.recip = @recipe
    @recipe_food.food = @food

    respond_to do |format|
      if @recipe_food.save
---
SELECT "recips".* FROM "recips" WHERE "recips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "recipe_foods" ("quantity", "created_at", "updated_at", "recip_id", "food_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["quantity", "20 g"], ["created_at", "2023-05-02 21:30:36.021293"], ["updated_at", "2023-05-02 21:30:36.021293"], ["recip_id", 1], ["food_id", 1]]

    def set_recipe_food
      @recipe_food = RecipeFood.find(params[:id])
---
SELECT "foods".* FROM "foods" WHERE "foods"."id" NOT IN ($1, $2, $3)  [["id", 24], ["id", 25], ["id", 26]]