app/models/recip.rb

SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recip_id" = $1  [["recip_id", 1]]
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
---
  def calculate_total_price(recipe)
    total_price = 0
    recipe.recipe_foods.each do |recipe_food|
      food = Food.find(recipe_food.food_id)